const startRoomId = "room1";

const rooms = [
    {
        "id": "room1",
        "name": "Таємнича Зала",
        "description": "Ви прокидаєтесь на холодній кам'яній підлозі величезної зали, освітленої мерехтливими смолоскипами. Величезні мармурові колони підтримують високий склепінчастий дах, а стіни прикрашені стародавніми фресками, які зображують сцени забутих битв і магічних ритуалів.",
        "type": "normal",
        "connections": [
            {
                "roomId": "room2",
                "name": "Внутрішній Сад",
            },
            {
                "roomId": "room3",
                "name": "Бібліотека Чаклунів",
                "condition": {
                    "type": "has",
                    "resourceId": "key1",
                    "description": "Двері закриті на величезний замок. До того ж, від нього віє магічною силою. Тут не обійдешься без ключа."
                },
            },
            {
                "roomId": "room4",
                "name": "Зачарований Коридор",
            }
        ],
        "resources": [],
    },
    {
        "id": "room2",
        "name": "Внутрішній Сад",
        "description": "Ви входите до чарівного саду, наповненого екзотичними рослинами і ароматами. Повітря тут насичене пахощами квітів, а в центрі саду знаходиться невелике озеро з кришталево чистою водою.",
        "type": "normal",
        "connections": [
            {
                "roomId": "room1",
                "name": "Таємнича Зала",
            },
            {
                "roomId": "room5",
                "name": "Альтанка Духів",
            },
            {
                "roomId": "room6",
                "name": "Кам'яний Лабіринт",
            }
        ],
        "resources": [],
    },
    {
        "id": "room3",
        "name": "Бібліотека Чаклунів",
        "description": "Ви опиняєтесь в великій бібліотеці, де книжкові полиці піднімаються до самої стелі. Повсюди стародавні фоліанти, магічні артефакти і сувої, що виблискують магічним світлом.",
        "type": "normal",
        "connections": [
            {
                "roomId": "room1",
                "name": "Таємнича Зала",
            },
            {
                "roomId": "room7",
                "name": "Таємний Архів",
            },
            {
                "roomId": "room8",
                "name": "Лабораторія Магії",
            }
        ],
        "resources": [],
    },
    {
        "id": "room4",
        "name": "Зачарований Коридор",
        "description": "Ви потрапляєте в довгий коридор з кам'яними стінами, на яких розвішані стародавні гобелени. По мірі просування вперед, коридор починає змінювати форму і повертати у несподіваних напрямках.",
        "type": "normal",
        "connections": [
            {
                "roomId": "room1",
                "name": "Таємнича Зала",
            },
            {
                "roomId": "room9",
                "name": "Зал Золотих Воріт",
            },
            {
                "roomId": "room10",
                "name": "Печера Тіней",
            }
        ],
        "resources": [],
    },
    {
        "id": "room5",
        "name": "Альтанка Духів",
        "description": "Ви входите в мальовничу альтанку, оточену деревами і квітами. Всередині альтанки стоїть круглий стіл, на якому мерехтить синє полум'я. Ви відчуваєте присутність невидимих істот.",
        "type": "normal",
        "connections": [
            {
                "roomId": "room2",
                "name": "Внутрішній Сад",
            },
            {
                "roomId": "room11",
                "name": "Ліс Сновиди",
            }
        ],
        "resources": [],
    },
    {
        "id": "room6",
        "name": "Кам'яний Лабіринт",
        "description": "Ви входите в заплутаний лабіринт з високих кам'яних стін. Лабіринт наповнений пастками і загадками. Відлуння ваших кроків лунає навколо, створюючи відчуття постійного спостереження.",
        "type": "normal",
        "connections": [
            {
                "roomId": "room2",
                "name": "Внутрішній Сад",
            },
            {
                "roomId": "room12",
                "name": "Зала Випробувань",
            }
        ],
        "resources": [],
    },
    {
        "id": "room7",
        "name": "Таємний Архів",
        "description": "Ви потрапляєте в приховану кімнату, де зберігаються найцінніші знання і секрети цього місця. Стіни вкрити старовинними картами і схемами, а посеред кімнати стоїть велика кована скриня.\n\nВи відкриваєте її, сподіваючись знайти щось цінне, але замість цього випускаєте давнє прокляття. З кімнати виривається темний туман, який швидко заповнює простір. Ви відчуваєте, як ваші сили залишають вас, і через мить падаєте на підлогу. Ось так завершився ваш шлях.",
        "type": "death",
        "connections": [
            {
                "roomId": "room3",
                "name": "Бібліотека Чаклунів",
            }
        ],
        "resources": [],
    },
    {
        "id": "room8",
        "name": "Лабораторія Магії",
        "description": "Ви заходите в лабораторію, де киплять різноманітні зілля і свистять магічні прилади. Повсюди стоять колби, реторти і таємничі артефакти, а повітря наповнене магічною енергією.",
        "type": "normal",
        "connections": [
            {
                "roomId": "room3",
                "name": "Бібліотека Чаклунів",
            },
            {
                "roomId": "room13",
                "name": "Зал Алхімії",
            }
        ],
        "resources": [],
    },
    {
        "id": "room9",
        "name": "Зал Алхімії",
        "description": "Ви заходите в залу, де зібрані всі необхідні інгредієнти для алхімічних експериментів. Тут ви можете створювати потужні зілля і магічні артефакти.",
        "type": "normal",
        "connections": [
            {
                "roomId": "room4",
                "name": "Зачарований Коридор",
            },
            {
                "roomId": "room14",
                "name": "Скриня Короля",
            }
        ],
        "resources": [],
    },
    {
        "id": "room10",
        "name": "Печера Тіней",
        "description": "Ви опиняєтесь в темній печері, де світло смолоскипів поглинається густими тінями. Відчувається присутність чогось зловісного і невідомого. Шляхи тут можуть здаватися оманливими і небезпечними.",
        "type": "normal",
        "connections": [
            {
                "roomId": "room4",
                "name": "Зачарований Коридор",
            },
            {
                "roomId": "room15",
                "name": "Забутий Грот",
            }
        ],
        "resources": [],
    },
    {
        "id": "room11",
        "name": "Ліс Сновиди",
        "description": "Ви опиняєтесь в лісі, де дерева ростуть так щільно, що майже не пропускають світло. Повітря наповнене магією, а звуки лісу занурюють вас в стан напівсну.\nВи раптом бачите мерехтливий світильник, що висить на гілці. Підходячи ближче, ви відчуваєте незвичайне тепло і вирішуєте доторкнутися до нього.\n\nЯк тільки ви торкаєтесь світильника, він вибухає яскравим світлом, і ви відчуваєте, як магія пронизує ваше тіло. Ви розумієте, що це пастка, але вже занадто пізно. Ваше тіло починає тверднути, і ви повільно перетворюєтеся на камінь. Ось так завершився ваш шлях.\n",
        "type": "death",
        "connections": [
            {
                "roomId": "room5",
                "name": "Альтанка Духів",
            }
        ],
        "resources": [],
    },
    {
        "id": "room12",
        "name": "Зала Випробувань",
        "description": "Ви заходите в залу, де вас очікують різні випробування. Тут потрібно проявити свою мудрість, силу і мужність, щоб подолати всі перешкоди.",
        "type": "normal",
        "connections": [
            {
                "roomId": "room6",
                "name": "Кам'яний Лабіринт",
            },
            {
                "roomId": "room16",
                "name": "Вежа Спогадів",
            }
        ],
        "resources": [],
    },
    {
        "id": "room13",
        "name": "Зал Золотих Воріт",
        "description": "Ви входите до зали, в центрі якої стоять величезні золоті ворота. Вони прикрашені складними орнаментами і інкрустовані дорогоцінними каменями. Ворота закриті і випромінюють потужну магічну енергію.\n\nПісля того, як ви увійшли в залу, ворота самі відкриваються перед вами. Ви проходите через них і відразу опиняєтесь в легендарному місці, описаному в старовинних легендах. Тут люди живуть у мирі і процвітанні, оточені чистими річками і зеленими лісами. Ваш шлях закінчується тут, де ви знаходите те, що шукали — місце, де ви зможете прожити своє найкраще життя!\n",
        "type": "winning",
        "connections": [
            {
                "roomId": "room8",
                "name": "Лабораторія Магії",
            }
        ],
        "resources": [],
    },
    {
        "id": "room14",
        "name": "Скриня Короля",
        "description": "Ви входите в залу, де стоїть величезна скриня, яка колись належала королю. В ній зберігаються найдорожчі скарби і магічні артефакти, але вона захищена потужними заклинаннями.\n\nВи вирішуєте відкрити скриню, не зважаючи на попередження. Як тільки ви торкаєтесь замка, навколо спалахує яскраве світло, і ви відчуваєте пекучий біль. Магічні заклинання активуються, і ваше тіло знерухомлюється, перетворюючись на камінь. Ось так завершився ваш шлях.\n",
        "type": "normal",
        "connections": [
            {
                "roomId": "room9",
                "name": "Зал Алхімії",
            },
            {
                "roomId": "room8",
                "name": "Лабораторія Магії",
            },
            {
                "roomId": "room17",
                "name": "Вогняний Алтар",
            }
        ],
        "resources": [],
    },
    {
        "id": "room15",
        "name": "Забутий Грот",
        "description": "Ви потрапляєте в стародавній грот, де ви відчуваєте присутність забутих духів і створінь. Стіни тут покриті стародавніми написами і малюнками.\n\nВи помічаєте блискучий амулет на кам'яному вівтарі і вирішуєте його взяти. Як тільки ви торкаєтесь амулета, стародавні написи починають світитися, а духи пробуджуються. Потужний енергетичний вихор піднімає вас у повітря, висмоктуючи життєві сили. Ось так завершився ваш шлях.\n",
        "type": "death",
        "connections": [
            {
                "roomId": "room10",
                "name": "Печера Тіней",
            }
        ],
        "resources": [],
    },
    {
        "id": "room16",
        "name": "Вежа Спогадів",
        "description": "Ви опиняєтесь на вершині високої вежі, з якої відкривається вид на всі навколишні землі. Тут зберігаються спогади про минулі часи і битви.",
        "type": "normal",
        "connections": [
            {
                "roomId": "room12",
                "name": "Зала Випробувань",
            },
            {
                "roomId": "room1",
                "name": "Таємнича Зала",
                "conditions": ["секретний хід"]
            }
        ],
        "resources": ["key1"],
    },
    {
        "id": "room17",
        "name": "Вогняний Алтар",
        "description": "Ви потрапляєте в кімнату, де серед цегляних стін стоїть величезний вогняний алтар. Полум'я викидає виразне червоне світло і наповнює кімнату теплом. На алтарі палають свічки, і зі стелі висять кришталеві гірлянди, створюючи магічну ауру.\n\nПідходячи ближче, ви помічаєте різні предмети, які виглядають як артефакти. Ви обираєте найвиглядніший і доторкаєтеся до нього, сподіваючись отримати його силу. Однак, як тільки ви доторкаєтесь, ви відчуваєте різкий удар енергії, який переповнює ваше тіло. Ви розумієте, що це була пастка — артефакт вбрав усю вашу енергію, залишивши вас безсиллим. Ось так завершився ваш шлях.\n",
        "type": "death",
        "connections": [
            {
                "roomId": "room14",
                "name": "Зала Випробувань",
            },
        ],
        "resources": [],
    }
];

const resources = [
    {
        id: "key1",
        name: "Зачарований ключ від дверей в Бібліотеку Чаклунів"
    },
];

module.exports = {
    startRoomId,
    rooms,
    resources,
}